# pre procesar los datos

In [1]:
import sys
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('datasets/BlackFriday.csv', sep=',')

In [7]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,0,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,0,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,0,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,1,55+,16,C,4+,0,8,NaN,NaN,7969

In [9]:
df.groupby(['Age']).count()

,User_ID,Product_ID,Gender,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
Age,,,,,,,,,,,
0-17,14707,14707,14707,14707,14707,14707,14707,14707,10466,4789,14707
18-25,97634,97634,97634,97634,97634,97634,97634,97634,68256,30889,97634
26-35,214690,214690,214690,214690,214690,214690,214690,214690,147745,65916,214690
36-45,107499,107499,107499,107499,107499,107499,107499,107499,74169,32758,107499
46-50,44526,44526,44526,44526,44526,44526,44526,44526,30441,13135,44526
51-55,37618,37618,37618,37618,37618,37618,37618,37618,25652,11018,37618
55+,20903,20903,20903,20903,20903,20903,20903,20903,13862,5773,20903

In [3]:
# diccionarios para normalizar datos
gender_dict = {'F':0, 'M':1}
age_dict = {'0-17':0, '18-25':1, '26-35':2, '36-45':3, '46-50':4, '51-55':5, '55+':6}
city_dict = {'A':0, 'B':1, 'C':2}
stay_dict = {'0':0, '1':1, '2':2, '3':3, '4+':4}

In [5]:
df["Gender"] = df["Gender"].apply(lambda x: gender_dict[x])

In [10]:
df["Age"] = df["Age"].apply(lambda x: age_dict[x])

In [11]:
df["City_Category"] = df["City_Category"].apply(lambda x: city_dict[x])

In [12]:
df["Stay_In_Current_City_Years"] = df["Stay_In_Current_City_Years"].apply(lambda x: stay_dict[x])